app/controllers/lista_de_tareas_controller.rb

SELECT * FROM `tareas` WHERE (`tareas`.lista_de_tarea_id = 5)
SELECT `lista_de_tareas`.id FROM `lista_de_tareas` WHERE (`lista_de_tareas`.user_id = 9)
---
  def show
    @lista_de_tarea = ListaDeTarea.find(params[:id])

SELECT `lista_de_tareas`.id FROM `lista_de_tareas` WHERE (`lista_de_tareas`.user_id = 9)
---
  def edit
    @lista_de_tarea = ListaDeTarea.find(params[:id])

INSERT INTO `lista_de_tareas` (`updated_at`, `nombre`, `user_id`, `created_at`) VALUES('2010-02-08 22:26:07', 'lista_tarea_prueba2', NULL, '2010-02-08 22:26:07')
INSERT INTO `users` (`updated_at`, `crypted_password`, `password_salt`, `persistence_token`, `login`, `email`, `created_at`) VALUES('2010-02-11 07:09:55', '89abe3bd624f1866ee31a6ab785755f85dea92ee6613067a9d2b6f6882f400733d9e0112131d6d2dd37359dadba44021f73d12f9f23ef25ba256f7b0e0211292', '-qKGjneABtg5D1nTgTzw', 'd916fe5c873a3f76f0644a8944e7858d3fd5c0c35c86ff81fc227d8b9834449f71529ce79e2cf870803c8c480684f10417f65c1dc3ef89dbbc2fed0d141d74d3', 'jack', 'juanmaflyer@gmail.com', '2010-02-11 07:09:55')
---
  def create
    @lista_de_tarea = current_user.lista_de_tareas.new(params[:lista_de_tarea])

    respond_to do |format|
      if @lista_de_tarea.save

SELECT * FROM `lista_de_tareas` WHERE (`lista_de_tareas`.`id` = 8)
UPDATE `lista_de_tareas` SET `nombre` = 'tareas en Casa', `updated_at` = '2010-02-08 22:54:36' WHERE `id` = 8
---
  def update
    @lista_de_tarea = ListaDeTarea.find(params[:id])

    respond_to do |format|
      if @lista_de_tarea.update_attributes(params[:lista_de_tarea])

SELECT * FROM `lista_de_tareas` WHERE (`lista_de_tareas`.`id` = 11)
DELETE FROM `lista_de_tareas` WHERE `id` = 11
DELETE FROM `tareas` WHERE ((lista_de_tarea_id = 7))
---
  def destroy
    @lista_de_tarea = ListaDeTarea.find(params[:id])
    @lista_de_tarea.destroy