app/controllers/tareas_controller.rb

  def new
	@lista_de_tarea = ListaDeTarea.find(params[:lista_de_tarea_id])
---
SELECT `lista_de_tareas`.id FROM `lista_de_tareas` WHERE (`lista_de_tareas`.user_id = 9)

  def create
	@list = ListaDeTarea.find(params[:lista_de_tarea_id])
    @task = @list.tareas.new(params[:tarea])
    if @task.save
---
SELECT * FROM `lista_de_tareas` WHERE (`lista_de_tareas`.`id` = 11)
INSERT INTO `tareas` (`updated_at`, `nombre`, `lista_de_tarea_id`, `created_at`) VALUES('2010-02-08 23:05:19', 'hola!', NULL, '2010-02-08 23:05:19')

  def edit
	@lista_de_tarea = ListaDeTarea.find(params[:lista_de_tarea_id])
---
SELECT * FROM `tareas` WHERE (`tareas`.`id` = 19 AND (`tareas`.lista_de_tarea_id = 11))
SELECT `lista_de_tareas`.id FROM `lista_de_tareas` WHERE (`lista_de_tareas`.user_id = 10)

  def update
	@lt = ListaDeTarea.find(params[:lista_de_tarea_id])
    @tarea = @lt.tareas.find(params[:id])


      if @tarea.update_attributes(params[:tarea])
---
SELECT * FROM `lista_de_tareas` WHERE (`lista_de_tareas`.`id` = 11)
SELECT * FROM `tareas` WHERE (`tareas`.`id` = 19 AND (`tareas`.lista_de_tarea_id = 11))
UPDATE `tareas` SET `nombre` = 'tarea numero2', `updated_at` = '2010-02-09 05:32:19' WHERE `id` = 19

  def destroy
	@lt = ListaDeTarea.find(params[:lista_de_tarea_id])
    @tarea = Tarea.find(params[:id])
    @tarea.destroy
---
SELECT * FROM `lista_de_tareas` WHERE (`lista_de_tareas`.`id` = 11)
SELECT * FROM `tareas` WHERE (`tareas`.`id` = 1)
DELETE FROM `tareas` WHERE `id` = 1