app/controllers/users_controller.rb

	def create
		@user = User.new(params[:user])
		if @user.save
---
INSERT INTO `users` (`updated_at`, `crypted_password`, `password_salt`, `persistence_token`, `login`, `email`, `created_at`) VALUES('2010-02-08 20:43:21', 'c70a7a430c350653789a9c0bde592118a9574ca1017d200ed8aefd4ec8aab9e1f9e8387021a68c8fd675044d462dff4f5d049652efd85a0be3b312216b9936b8', 'mRji2hdZKYuhQTMnq6zG', '5091a3bf894f0974d71ca2d82949ac2c4e6bbdfc4f47e61ffeeae148a703867bc70b009534ea9ff80da13fa0794bf069b0282776bed618671308d04314882032', 'juanmanuel', 'juanmanuel@gmail.com.asdf', '2010-02-08 20:43:21')

	def update
		 @user = current_user
		 if @user.update_attributes(params[:user])
---
UPDATE `users` SET `persistence_token` = 'da64676a8798be9d0feff8aae1d361578adf673cd7292f221b500b9b56512ee47408d15e5004dda3414d0e8570e78a91c8119d352bb71d57891224e20385af46', `login` = 'prueba', `crypted_password` = '7cd1a860ea4d1300fbc749a0af9ca8051e0293b44403dd72580b862a50a4747fa88d2d00f97d702502748d5fcd6b38cbda6aa57891ed508a8304c4cd3e343247', `updated_at` = '2010-02-10 04:16:59', `password_salt` = 'oKBHSSnGNto9oNOEVsEM' WHERE `id` = 10